
# Avaliação Prática — Fundamentos de Pandas (Módulo 3)

Esta avaliação contém **10 questões** de nível introdutório sobre **Pandas** e **análise de dados**.
O foco é demonstrar domínio das operações básicas de **importação**, **inspeção** e **manipulação simples** de DataFrames.

**Instruções gerais:**
- Responda **apenas** nas células de código logo abaixo de cada enunciado.
- Execute a célula **Setup** antes de começar.
- Utilize o arquivo CSV fornecido: **`avaliacao_empresa.csv`** (na mesma pasta deste notebook).

In [4]:

# Setup (execute esta célula primeiro — não alterar)
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

pd.set_option("display.max_rows", 30)
pd.set_option("display.max_columns", 30)
print("Ambiente pronto.")

Ambiente pronto.

### Questão 1) Importe o arquivo CSV e crie um DataFrame chamado `df`.

In [7]:
# Insira o código que importa o .csv e o transforma em DataFrame (há um método que faz as duas coisas)
# Dica: use pd.read_csv(...)
# CAMINHO = "avaliacao_empresa.csv"
# df = 
df = pd.read_csv("avaliacao_empresa.csv")
df

,id_funcionario,nome,departamento,turno,cidade,data,vendas_qtd,ticket_medio,faturamento,custo,lucro,horas_trabalhadas,salario
0,2,Bruno,Operacoes,Tarde,Campinas,2025-01-01,56,975.0,54600.0,41435.15,13164.85,166,8086
1,3,Carla,TI,Noite,Sao Paulo,2025-01-08,50,415.0,20750.0,10791.38,9958.62,142,8703
2,4,Diego,Vendas,Manha,Campinas,2025-01-15,55,107.0,5885.0,4287.17,1597.83,130,8221
3,5,Elaine,Operacoes,Tarde,Sao Paulo,2025-01-22,11,755.0,8305.0,4328.67,3976.33,147,4954
4,6,Fabio,TI,Noite,Campinas,2025-01-29,44,456.0,20064.0,11597.60,8466.40,158,6378
5,7,Giovana,Vendas,Manha,Sao Paulo,2025-02-05,37,874.0,32338.0,25812.20,6525.80,184,8193
6,8,Henrique,Operacoes,Tarde,Campinas,2025-02-12,43,971.0,41753.0,33218.02,8534.98,157,4556
7,9,Iris,TI,Noite,Sao Paulo,2025-02-19,51,324.0,16524.0,10658.24,5865.76,129,3476
8,10,Joao,Vendas,Manha,Campinas,2025-02-26,29,149.0,4321.0,2618.33,1702.67,197,6137
9,11,Karen,Operacoes,Tarde,Sao Paulo,2025-03-05,49,1384.0,67816.0,44195.04,23620.96,155,6438
10,12,Lucas,TI,Noite,Campinas,2025-03-12,19,795.0,15105.0,7537.49,7567.51,199,3274
11,13,Marina,Vendas,Manha,Sao Paulo,2025-03-19,10,369.0,3690.0,2497.44,1192.56,190,4463
12,14,Nicolas,Operacoes,Tarde,Campinas,2025-03-26,44,617.0,27148.0,10899.75,16248.25,169,8429
13,15,Olivia,TI,Noite,Sao Paulo,2025-04-02,41,316.0,12956.0,6569.21,6386.79,197,8746
14,16,Paulo,Vendas,Manha,Campinas,2025-04-09,15,813.0,12195.0,9010.40,3184.60,176,7230
15,17,Queila,Operacoes,Tarde,Sao Paulo,2025-04-16,7,1138.0,7966.0,3477.94,4488.06,139,6609
16,18,Rafa,TI,Noite,Campinas,2025-04-23,44,810.0,35640.0,26677.81,8962.19,174,5475
17,19,Sara,Vendas,Manha,Sao Paulo,2025-04-30,40,937.0,37480.0,15880.30,21599.70,172,5642
18,20,Teo,Operacoes,Tarde,Campinas,2025-05-07,37,552.0,20424.0,9396.67,11027.33,150,8342
19,1,Ana,TI,Noite,Sao Paulo,2025-05-14,27,631.0,17037.0,13484.77,3552.23,151,6916
20,2,Bruno,Vendas,Manha,Campinas,2025-05-21,29,947.0,27463.0,17993.72,9469.28,163,7461
21,3,Carla,Operacoes,Tarde,Sao Paulo,2025-05-28,57,311.0,17727.0,10212.97,7514.03,148,4709
22,4,Diego,TI,Noite,Campinas,2025-06-04,7,663.0,4641.0,2035.92,2605.08,152,9297
23,5,Elaine,Vendas,Manha,Sao Paulo,2025-06-11,57,401.0,22857.0,15284.61,7572.39,121,5092
24,6,Fabio,Operacoes,Tarde,Campinas,2025-06-18,32,1323.0,42336.0,28148.61,14187.39,162,4029
25,7,Giovana,TI,Noite,Sao Paulo,2025-06-25,51,1283.0,65433.0,50905.52,14527.48,168,8894

### Questão 2) Mostre os **5 primeiros** elementos do DataFrame.

In [9]:
df.head(5)

,id_funcionario,nome,departamento,turno,cidade,data,vendas_qtd,ticket_medio,faturamento,custo,lucro,horas_trabalhadas,salario
0,2,Bruno,Operacoes,Tarde,Campinas,2025-01-01,56,975.0,54600.0,41435.15,13164.85,166,8086
1,3,Carla,TI,Noite,Sao Paulo,2025-01-08,50,415.0,20750.0,10791.38,9958.62,142,8703
2,4,Diego,Vendas,Manha,Campinas,2025-01-15,55,107.0,5885.0,4287.17,1597.83,130,8221
3,5,Elaine,Operacoes,Tarde,Sao Paulo,2025-01-22,11,755.0,8305.0,4328.67,3976.33,147,4954
4,6,Fabio,TI,Noite,Campinas,2025-01-29,44,456.0,20064.0,11597.60,8466.40,158,6378

### Questão 3) Exiba as **informações gerais** do DataFrame (tipos de dados e nulos).

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 13 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id_funcionario     26 non-null     int64
 1   nome               26 non-null     object
 2   departamento       26 non-null     object
 3   turno              26 non-null     object
 4   cidade             26 non-null     object
 5   data               26 non-null     object
 6   vendas_qtd         26 non-null     int64
 7   ticket_medio       26 non-null     float64
 8   faturamento        26 non-null     float64
 9   custo              26 non-null     float64
 10  lucro              26 non-null     float64
 11  horas_trabalhadas  26 non-null     int64
 12  salario            26 non-null     int64
dtypes: float64(4), int64(4), object(5)
memory usage: 2.8+ KB

### Questão 4) Mostre o **formato (linhas, colunas)** e a **lista de colunas** do DataFrame.

In [16]:
print(df.shape)
print(df.columns)

(26, 13)
Index(['id_funcionario', 'nome', 'departamento', 'turno', 'cidade', 'data',
       'vendas_qtd', 'ticket_medio', 'faturamento', 'custo', 'lucro',
       'horas_trabalhadas', 'salario'],
      dtype='object')

### Questão 5) Exiba as **estatísticas descritivas** das colunas numéricas (média, min, max, etc.).

In [20]:
# Utilize o método para estatísticas descritivas
# ...
df.describe()

,id_funcionario,vendas_qtd,ticket_medio,faturamento,custo,lucro,horas_trabalhadas,salario
count,26.000000,26.000000,26.000000,26.000000,26.000000,26.000000,26.000000,26.000000
mean,9.115385,36.230769,704.461538,24709.769231,16113.651154,8596.118077,161.384615,6528.846154
std,5.826333,16.307808,357.249966,18055.721968,13710.279075,5829.027283,21.183157,1829.020824
min,1.000000,7.000000,107.000000,3690.000000,2035.920000,1192.560000,121.000000,3274.000000
25%,4.250000,27.500000,404.500000,12385.250000,6811.280000,4104.262500,148.500000,4988.500000
50%,7.500000,40.500000,709.000000,20244.000000,10845.565000,7569.950000,160.000000,6523.500000
75%,13.750000,49.750000,944.500000,34814.500000,23857.580000,10760.152500,173.500000,8214.000000
max,20.000000,57.000000,1384.000000,67816.000000,50905.520000,23620.960000,199.000000,9297.000000

### Questão 6) Selecione apenas as colunas `nome` e `departamento` e mostre as **5 primeiras** linhas.

In [24]:
# Selecione as colunas solicitadas e mostre 5 primeiras linhas
# ...
df [ ["nome", "departamento"] ].head(5)

     nome departamento
0   Bruno    Operacoes
1   Carla           TI
2   Diego       Vendas
3  Elaine    Operacoes
4   Fabio           TI

### Questão 7) Filtre os registros do **turno 'Noite'** e **conte** quantos registros existem.

In [63]:
# Filtre df['turno'] == 'Noite' 
df[df["turno"] == "Noite"].count()

id_funcionario       9
nome                 9
departamento         9
turno                9
cidade               9
data                 9
vendas_qtd           9
ticket_medio         9
faturamento          9
custo                9
lucro                9
horas_trabalhadas    9
salario              9
mes                  9
dtype: int64

### Questão 8) O código abaixo converte as datas de texto para data e em seguida cria uma coluna mês para os dados.
Mostre as **5 primeiras** linhas de `df[['data','mes']]`.

In [39]:
df['data']=pd.to_datetime(df['data'],errors='coerce')
df['mes']=df['data'].dt.to_period('M').astype(str)
df[['data','mes']]
df.head(5)

,id_funcionario,nome,departamento,turno,cidade,data,vendas_qtd,ticket_medio,faturamento,custo,lucro,horas_trabalhadas,salario,mes
0,2,Bruno,Operacoes,Tarde,Campinas,2025-01-01,56,975.0,54600.0,41435.15,13164.85,166,8086,2025-01
1,3,Carla,TI,Noite,Sao Paulo,2025-01-08,50,415.0,20750.0,10791.38,9958.62,142,8703,2025-01
2,4,Diego,Vendas,Manha,Campinas,2025-01-15,55,107.0,5885.0,4287.17,1597.83,130,8221,2025-01
3,5,Elaine,Operacoes,Tarde,Sao Paulo,2025-01-22,11,755.0,8305.0,4328.67,3976.33,147,4954,2025-01
4,6,Fabio,TI,Noite,Campinas,2025-01-29,44,456.0,20064.0,11597.60,8466.40,158,6378,2025-01

### Questão 9) O código abaixo agrupa e soma os valores por mes no DataFrame fat.
Mostre os **3 meses** com maior faturamento.

In [66]:
fat = df.groupby('mes',as_index=False)['faturamento'].sum()
fat.sort_values("faturamento",ascending=False)

       mes  faturamento
5  2025-06     135267.0
2  2025-03     113759.0
0  2025-01     109604.0
3  2025-04     106237.0
1  2025-02      94936.0
4  2025-05      82651.0

### Questão 10) Calcule a **média de salário por departamento** e mostre em **ordem decrescente**.

In [62]:
#df.groupby('departamento',as_index=False)['salario'].mean().sort_values('salario',ascending=False)
salarios_por_departamento = df.groupby("departamento",as_index=False)["salario"]
df.groupby("departamento")["salario"].mean().sort_values(ascending=False)
#Insira seu código aqui

departamento
TI           6795.444444
Vendas       6554.875000
Operacoes    6239.111111
Name: salario, dtype: float64


---
## Extra (não avaliativo) — Demonstração de visualização

O gráfico abaixo mostra a **distribuição do faturamento por mês e por departamento** (barras empilhadas).  
**Ação do aluno:** **apenas execute** a célula para observar o resultado e refletir sobre variações por mês e por área.

In [ ]:

# ▶️ Execute esta célula (não alterar o código)
# Pré-requisitos: df já carregado; coluna 'data' convertida; coluna 'mes' criada (Questões 1 e 8).
df['data'] = pd.to_datetime(df['data'], errors='coerce')
df['mes'] = df['data'].dt.to_period('M').astype(str)

fat_mes_dep = df.groupby(['mes','departamento'], as_index=False)['faturamento'].sum()
pivot = fat_mes_dep.pivot(index='mes', columns='departamento', values='faturamento').fillna(0)

ax = pivot.plot(kind='bar', stacked=True, figsize=(10,6))
ax.set_title("Faturamento por Mês e Departamento (barras empilhadas)")
ax.set_xlabel("Mês (YYYY-MM)")
ax.set_ylabel("Faturamento (R$)")
import matplotlib.pyplot as plt
plt.xticks(rotation=45)
plt.tight_layout()
plt.show()